// © Copyright 2004-2008, 2015-2016 HP Development Company, L.P.

HSDTaskName = "Ladda upp fil";
kUploadingTitleStringKey = "Laddar upp…";
kUploadingReceiveResponseTitleStringKey = "Tar emot svar…";

// Errors
kFileOpenError = "Kan inte öppna filen %@.";
kFileOpenErrorExplanation = "Denna fil är antingen korrumperad eller den kan ha flyttats till en annan plats, döpts om eller raderats. Kontrollera filens placering eller välj en annan fil och försök igen.";
kPrintChannelOpenError = "Kan inte öppna en skrivarkanal.";
kPrintChannelOpenErrorExplanation = "Kontrollera att skrivaren är ansluten och påslagen. Försök igen.";
kSendDataError = "Kan inte skicka data till skrivaren.";
kSendDataErrorExplanation = "Kontrollera att skrivaren är ansluten och påslagen. Försök igen.";

HSDDescriptionField = "Välj en fil och överför den till skrivaren. Resultatet av denna åtgärd beror på innehållet i den fil som du överför.";
HSDFilePathLabel = "Filnamn:";
HSDFilePathField = "<Ej vald>";
HSDChooseButton = "Välj…";
HSDGetResponseButton = "Visa svar från enheten";
HSDUploadButton = "Ladda upp";

HSDProgressTitle = "Laddar upp…";
HSDCancelButton = "Avbryt";

HSDCloseButton = "Stäng";
